/* 
 * File:   tic.c
 * Author: Козырев С.А.
 *  24.08.15 с:\16062014  
 * pic16f1826 работа с TIC32
 * написание под MPLAB X8C на PIC16F1826
 * 
 * 
 * 
 * V1.0 24.08.15
 * 					--------
 * 			RA2		1     18    RA1
 *			RA3		2     17    RA0     AN0         (*)
 * 			RA4		3     16    RA7
 * 			RA5		4     15    RA6
 * 			Vss		5     14    Vdd
 * 	 RES	RB0		6     13    RB7
 *	 SDA1	RB1		7     12    RB6    СВЕТОДИОД    (*)
 *	 RX		RB2		8     11    RB5    TX
 *	 D1	    RB3		9     10    RB4    SCL1
 *					--------
 *					
 *		        TIC32			
 *		7    6    5    4    3    2     1	
 *     SCL  GND  SDA  VDD1 VDD2 RES   VLCD
 *                   +2.5V 
 +
 *  прикрутили git 17.09.15
 *  http://www.tsdp.byethost7.com/  18.09.15  qdpm   tic+pic+gif
 *  c:\solar\22.jpeg     pcb макета
 *  c:\solar\12.jpeg     pcb макета
 *  c:\kurs\tic32.pdf
 *  c:\16062014\pic16f1827.pdf
 *
 */


#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <xc.h> 					// include standard header file

// set Config bits
#pragma config FOSC=INTOSC, PLLEN=OFF, WDTE=ON, MCLRE=ON,
#pragma config CLKOUTEN=OFF, IESO=OFF, FCMEN=OFF,CP=OFF, CPD=OFF,BOREN=OFF
#pragma config WRT=OFF,STVREN=ON,BORV=LO,LVP=OFF


//#define	otladka
#undef otladka		
//#define	otladka_adc
#undef otladka_adc	

																
#define _XTAL_FREQ  		16000000        // this is used by the __delay_ms(xx) and __delay_us(xx) functions
#define temp     			-(40000)   

#define ok_     			0x01      // 1
#define bad_crc_     		0x02      // 2
#define	ready_	            0x04
#define	state_	  		    0x08									//  есть\нет изменение состояния                        999  -  0x3e7    ~ 10 bit      4 0x08 
#define dac_	         	0x10									//  есть\нет изменение состояния БП                       5  0x10        0x18
#define	key_	        	0x20					            	//  есть\нет изменение состояния вкл\откл                 6  0x20        0x28
#define	temper_   	        0x40							    	//  есть\нет изменение состояния температура              7  0x40        0x48
#define	adc_		        0x80									//  есть\нет изменение состояния напряжение               6  0x80        0x88

#define	assig_		      	0x100											    //  установить изменения состояния по запросу инженерной панели         9 0x100
#define	zapr_	    		0x200												//  запросить (flash инженерной панели)                                10 0x200
#define  LCD_WC          	(0x00)
#define  LCD_ADDR        	(0x78)          // Device addresses (7 bits, lsb is a don't care)
#define  WRITE           	0x00            // SMBus WRITE command
#define  READ            	0x01            // SMBus READ command
											//#define LCD_RESET (RC5)
#define LCD_ADDR (0x78)
											//#define CON1 (0b10000000)
											//#define CON2 (0b01000000)

											
#define		ON_LIGHTE()		{ LATBbits.LATB3 = 0; }											
#define		OFF_LIGHTE()	{ LATBbits.LATB3 = 1; }												
											
											
											
											
#define TEMPERATURE_UNDER -55               // Значение температуры, возвращаемое если сумма результатов АЦП больше первого значения таблицы 
#define TEMPERATURE_OVER 125             	// Значение температуры, возвращаемое если сумма результатов АЦП меньше последнего значения таблицы 
#define TEMPERATURE_TABLE_START -50        	// Значение температуры соответствующее первому значению таблицы 
#define TEMPERATURE_TABLE_STEP 5           	// Шаг таблицы  


#ifdef otladka
											
	int temper;

#endif
	unsigned int AnalogValue;


	unsigned char  a1,i;								//  a5      on/off 
														//  a4   // ready
														//  a3	 // temper //
														//  a2	 // ADC
														//  a1   // DAC  
														//
	unsigned char  a11;					                //
														//  a44  // частота 2 значение flash
														//
														//
														//

	unsigned char	flag_xvost_temper,tmp;   			// выбор буфера оцифровки температуры     поменять на bit
	unsigned char	flag_adc;		 					// выбор буфера оцифровки напряжения      поменять на bit
	extern  const unsigned char  TABL [155][6];
	
	
	
									//	unsigned char 	flag_zanyato_adc1,flag_zanyato_adc2,flag_peredacha_adc;
									//	unsigned char 	flag_zanyato_temper1,flag_zanyato_temper2,flag_peredacha_temper,flag_usart;
										/*
										const unsigned int termo_table[] = {
										62862, 58119, 52955, 47556, 42128, 36867, 31928, 27421,
										23401, 19883, 16850, 14262, 12073, 10230, 8684, 7389,
										6305, 5397, 4634, 3993, 3453, 2997, 2610, 2280,
										2000, 1759, 1553, 1375, 1222, 1088, 973, 871,
										783, 706, 637, 577
									};	*/

#ifdef otladka
										


const unsigned int termo_table[] = {
    63554, 59261, 54478, 49349, 44055, 38778, 33720, 28991,
    24712, 20909, 17608, 14773, 12375, 10357, 8674, 7273,
    6109, 5143, 4343, 3677, 3124, 2662, 2277, 1954,
    1682, 1453, 1259, 1095, 955, 836, 734, 646,
    571, 505, 449, 400
};

										
#endif
const char  init_lcd[21] = {	
	 							0x01,  					//  page 000
								0x0e,  					//  page 110
								0x12,  //  mux 1/34		0x12
								0x84,  //  BIAS	1:65
								0x06,  //  normal mode
								0x24,  // set current
								0x0c,  // mirror
								0x01,  					//  page 000
								0x10,	// power-down gorizont
								0x0b,					//  page 011
								0x58,	// TRS    BRS
								0x05,	// DM =1;
								0x01,					//  page 000
								0x0d,					//  page 101
								0x09,	// mul factor
								//0x06,
								0x04,	// vlcd low
								0xb5,	// napriagenie
								0x05,	// start generator
								0x01, 					//  page 000
								0x0b, 					//  page 011
								0x04};	// direct mode///////////////////




								
#ifdef otladka
															
unsigned int adcsum;
 unsigned char rr = (sizeof(termo_table) / sizeof(termo_table[0])) - 1;

#endif
	void interrupt Interrupt()
{

										
		if ((PIE1bits.SSP1IE==1)&(PIR1bits.SSP1IF == 1 ))  //////////////////// ОЦИФРОВКА	
			{
				PIR1bits.SSP1IF = 0;	
			}
			
		#ifdef otladka	
		if ((PIE1bits.ADIE==1)&(PIR1bits.ADIF == 1 ))  //////////////////// ОЦИФРОВКА	
		{
			PIR1bits.ADIF = 0;	
				
							// температура
					
								
										
			AnalogValue 			= ADRESH << 8;        		 // get the 2 msbs of the result and rotate 8 bits to the left
			AnalogValue 			=	AnalogValue + ADRESL;   // now add the low 8 bits of the resut into our return variable
																							//	AnalogValue =20909;
										#ifdef otladka
											AnalogValue21 =s21++;
										#endif
			asm("nop");
																							//	ADCON0bits.GO = 1; 
			flag_adc = 1;	
}	

										
#endif
}
#ifdef otladka
										

	 int sea(unsigned int rr)
	{
		unsigned char m,r,l=0;

		int z,z1,z2,res;
		r = rr;

		if (adcsum > termo_table[0])
   				return (-55);
		else if (adcsum < termo_table[rr])
				return (+125);
		else
				{
					while ((r - l) > 1) {
   							  m = (l + r) >> 1;
   							 z=termo_table[m];
    						if (adcsum > termo_table[m])
	 							{
      								r = m;
    							 } 
							else 
								{
      								l = m;
    							}
  							}
		if (adcsum >=termo_table[l])
 			return l * TEMPERATURE_TABLE_STEP + TEMPERATURE_TABLE_START;
		res = TEMPERATURE_TABLE_START + r * TEMPERATURE_TABLE_STEP;
		if (termo_table[l]-termo_table[r])
				{

					z = ( (adcsum - termo_table[r]) ); 

					z1 =(int)ceil((termo_table[l]-termo_table[r])/5.0); 

					z2 =(z/z1);
					if (r < 11)
						res-=z2;
					else
						{

							res-=z2;
						}

					return (res); 
				}
		else
			return res;
			}
	}
	

										
#endif	
	void initc(void)
		{
		
											//			fist 	= 0;     // таймаут по приходу включения
																									//	ok 		=0;
																									//ok4 	=1;
																									//ok3 	= 0;
																									//ok2 	= 1;
											//			right 	= 1;
											//			left 	= 1;
											//			key 	= 1;
											//			takt 	= 1;	
											//			sekond 	= 0;  // готовность 0
											//			ready_command 	= 0;
											//			adc_command 	= 0;
											//			dac_command 	= 0;
											//			state_command 	= 0;
														//zapr_command 	= 0;
											//			ass_command = 0;
														//on_command =0;
											//			key_command = 0;
											//			sekond2 = 0;
											//			sek2 = 0;
											///			decimal = 1;
											//			bvminus = 1;
											//			takt1 = 0; 
											//			takt2= 1;
											//			takt22 = 0;
											//			key_state = 1;
											//			key_ok =0;
											//			flag_usart = 0;
			flag_adc = 0;

											//			a5 = 0;
#ifdef  otladka
			s11 = 10;
			s12 = 30;
			s21 = 50;
			s22 = 70;


			tmp = eeprom_read(1);	
		if ((tmp  != 0x35))
			{
				eeprom_write(1,0x35);   // код присутствия flash
				eeprom_write(2,0x10);		// период ключа
			
				a1 = eeprom_read(2);		// период ключа
				a11 = a1;
				a1 = eeprom_read(1);		// период ключа
			
			}
		else 
			{ 
										//				a1 = eeprom_read(2);	// период ключа
										//				a11 = a1;
			
			}
#endif		

//			decimal = 0;
		}
///////////////////////////////////////////////////////////////////////////////////////		

int main(int argc, char** argv) {

	// осциллограф
    OSCCONbits.SCS    = 0x02;    //set the SCS bits to select internal oscillator block
    OSCCONbits.IRCF   = 0x0f;   // 16mHz
    OSCCONbits.SPLLEN = 0x00;  // pll dicable

    
     // PORT C Assignments
	PORTA  = 0;
	PORTB  = 0;
	LATA   = 0;
	LATB   = 0;
	ANSELB = 0;
	ANSELA = 0;

	// альтернатива
	APFCON0bits.RXDTSEL=1;
	APFCON1bits.TXCKSEL=1;
	
    TRISBbits.TRISB0 = 0;	// RB0 = res
    TRISBbits.TRISB1 = 0;	// RB1 = SDA1
    TRISBbits.TRISB2 = 1;	// RB2 = это пириемник RX
    TRISBbits.TRISB3 = 0;	// RB3 = светодиод
    TRISBbits.TRISB4 = 0;	// RB4 = SCL1
    TRISBbits.TRISB5 = 0;	// RB5 = это передатчик TX
    TRISBbits.TRISB6 = 0;	// RB6 = 
    TRISBbits.TRISB7 = 0;	// RB7 = 



	TRISAbits.TRISA0 = 1;	// RA0 = NTC 10k  аналоговый
    TRISAbits.TRISA1 = 0;	// RA1 = 
    TRISAbits.TRISA2 = 0;	// RA2 = 
    TRISAbits.TRISA3 = 0;	// RA3 =  									  
    TRISAbits.TRISA4 = 0;	// RA4 = 
    TRISAbits.TRISA5 = 0;	// RA5 = 
    TRISAbits.TRISA6 = 0;	// RA6 = 
    TRISAbits.TRISA7 = 0;	// RA7 =
	
#ifdef otladka
													
			
			ANSELAbits.ANSA0	= 1;			// Select A0 as analog input pin for potentiometer input
																					//ANSELAbits.ANSA1=1;		// Select A1 as analog input pin for potentiometer input
			ADCON0bits.CHS		= 0x00;			// This selects which analog input to use for the ADC conversion
												// ADCON0bits.CHS		= 0x01;	// This selects which analog input to use for the ADC conversion
												//	ANSELAbits.ANSA1	= 1;
			ANSELAbits.ANSA0	= 1;
			ADCON0bits.ADON		= 1;			// ADC is on
			ADCON1bits.ADCS		= 0x02;			// select ADC conversion clock select as Fosc/32
			ADCON1bits.ADFM		= 0x00;       	// results are left justified
			ADCON1bits.ADNREF	= 0x0;      	// 0=VREF- is connected to VSS
			ADCON1bits.ADPREF	= 3;     		 // 00=VREF+ is connected to VDD
												//ADCON1bits.ADPREF=0x03;      // VREF+ is connected to internal Fixed Voltage Reference (FVR) module
			
			TMR1L=(0xff & temp);
			TMR1H =(0xff & (temp >> 8));     
			T1CONbits.T1CKPS = 0x03;					// 00= 1:1 Prescale value
			T1CONbits.TMR1ON = 0X01;					// включить таймер


			FVRCONbits.ADFVR   = 0x02;  		//   ADC Fixed Voltage Reference Peripheral output is 2x (2.048V)(


			FVRCONbits.CDAFVR  = 0x02;
			FVRCONbits.FVREN   = 0x01;
			

#endif
			
			
												//DACCON0bits.DACPSS = 0X2;    //00=VDD
																			//01=VREF+
																			//10= FVR Buffer2 output
																			//11= Reserved, do not use
												//DACCON0bits.DACOE  = 1;		// 1= DAC voltage level is also an output on the DACOUT pin
												//DACCON0bits.DACLPS = 1;     // 1= DAC Positive reference source selected
												//DACCON0bits.DACEN  = 1;		// 1= DAC is enabled

												//DACCON0bits.DACNSS = 0;		// 0=VS
												//T2CONbits.T2OUTPS  = 0x0F;
												//T2CONbits.T2CKPS   = 0x03;
												//PR2                = 38;  					//40
												//T2CONbits.TMR2ON   = 1;

												////	T6CONbits.T6OUTPS  = 0x02;
												//	T6CONbits.T6CKPS   = 0x00;
												//	PR6                = 200;  //40
												//	T6CONbits.TMR6ON   = 1;	


												//	T4CONbits.T4OUTPS  = 0x00;
												//	T4CONbits.T4CKPS   = 0x00;
												//	PR4                = 70;  //40
												//	T4CONbits.TMR4ON   = 1;	




												//	WDTCONbits.WDTPS = 0x08;   //  00110= 1:2048 (Interval 64 ms typ)
												//	WDTCONbits.SWDTEN = 0x01;  //


			BAUDCONbits.BRG16  = 0X01; 		// 1= 16-bit Baud Rate Generator is used	

			SPBRGL=(0xff & 206);								// !!!!!!!!!!!!! это 9600 не забудь вернуть 19200
			SPBRGH =(0xff & (206 >> 8));   

				
												//	SPBRG =  414; //;  //       33  1666*2  206


												//	TXSTAbits.CSRC = 0X01;						// Asynchronous mode: Don’t care
													/*
													TXSTAbits.TX9  = 0X01;						// 0= Selects 8-bit transmission
													TXSTAbits.SYNC = 0X00;						// 0= Asynchronous mode
													TXSTAbits.BRGH = 0X01;						// 1= High speed
													TXSTAbits.TX9D=1;							// Can be address/data bit or a parity bit
													*/
																								 // RCSTAbits.RX9  = 0X0; 
			SSP1CON1bits.SSPEN = 1;
			SSP1CON1bits.SSPM = 0x08;
			SSP1STATbits.SMP = 1;
			SSP1ADD = 0x27;   // 100kHz
							  // 0x09  400kHz 

													//PIE3bits.TMR6IE=1;     //1= Enables the TMR4 to PR4 Match interrup  
													//PIE3bits.TMR4IE=1;     //1= Enables the TMR4 to PR4 Match interrup  
												//	PIE1bits.TMR2IE=1;               // разрешили прерыване таймера 2
			PIE1bits.ADIE = 1;
			PIE1bits.SSP1IE = 1;
											//	INTCONbits.IOCIE = 1;											//	PIR1=0;
			INTCONbits.PEIE  = 1;          	// Enable peripheral interrupt
			INTCONbits.GIE   = 1;           	// enable global interrupt
											//	PIE1bits.TMR1IE  = 0x01;      	// enable the Timer 1 parator interrupt

											//	PIE1bits.RCIE   = 0x01; 		// разрешение прерывания по приемнику
											//	PIE1bits.TXIE=0x01; 			//  разрешили прерывание от передатчика
																																				//	i = data_eeprom_read(0x01);

											//	RCSTAbits.CREN = 0X01; 			// 1= Enables receiver 
											//	RCSTAbits.SPEN = 0X01;			// Asynchronous mode: Don’t care
											//	RCSTAbits.RX9 = 0X01; 			// 1= Selects 9-bit reception		

			


#ifdef otladka
											
			RCSTAbits.ADDEN	=1;

#endif	
											//	flag_razborka = 0;
																				//	tr_bu = &master;
												

											//	IOCBNbits.IOCBN4 = 1;
	

			initc();
		
			ON_LIGHTE();
			OFF_LIGHTE();			
						//		LATAbits.LATA1 = 0;	
						//		LATAbits.LATA3 = 1;	
						//		LATAbits.LATA2 = 1;	
						//		PIE3bits.TMR6IE=1;     //1= Enables the TMR4 to PR4 Match interrup  

																	//	while (1)


							//	while (1)
{
			LATBbits.LATB3  = 0; 	// включили приемник
			LATBbits.LATB3  = 1; 
							//			tr_bu3 = &bu;			// буфер приема
							//			flag_read = 0;
							//while (1)
{	
			LATBbits.LATB0=0;
			while(++i);
			LATBbits.LATB0=1;
		
}
		while (1)
		{
			SSP1BUF = 0x72;
										//SSP1CON2bits.SEN=1; //
										// SSP1CON2
										// PEN: Stop Condition Enable bit (in I2C Master mode only)
										// RSEN: Repeated Start Condition Enabled bit (in I2C Master mode only)
										// SEN: Start Condition Enabled bit (in I2C Master mode only)
										// RCEN: Receive Enable bit (in I2C Master mode only)
										
										//  ACKSTAT: Acknowledge Status bit (in I2C mode only)  1 = Acknowledge was not received   0 = Acknowledge was received
										//  
										//
										//
				asm("nop");
				asm("nop");
				asm("nop");
				asm("nop");
			
		}

}
#ifdef otladka
											
ADCON0bits.GO = 1; 

										#endif
while (1)
			{
			asm("nop");
#ifdef otladka
													
			if (flag_adc)
				{
					adcsum = AnalogValue;	
					temper = sea(rr);
					asm("nop");
					ADCON0bits.GO = 1; 

					while (1)															
					asm("nop");
					asm("nop");
					asm("nop");
					asm("nop");

											//	asm("sleep");
				}	
#endif				
									//ANSELAbits.ANSA0=1;		// Select A0 as analog input pin for potentiometer input
														//	AnalogValue1 = Read_ADC_Value();
			}
			
										//razborka2();		

 return (EXIT_SUCCESS);
	}

const unsigned char  TABL [155][6]=
                {{ 0x00,0x000,0x000,0x000,0x00, 00},
                  {0x00,0x000,0x04f,0x000,0x00, 00},  //;!
                  {0x00,0x007,0x000,0x007,0x00, 00},  //;"
                  {0x14,0x07f,0x014,0x07f,0x14, 00},  //;#
                  {0x24,0x02A,0x07F,0x02A,0x12, 00},  //;$
                  {0x23,0x013,0x008,0x064,0x62, 00},  //;%
                  {0x36,0x049,0x055,0x022,0x40, 00},  //;&
                  {0x00,0x005,0x003,0x000,0x00, 00},  //;'								 
                  {0x00,0x01c,0x022,0x041,0x00, 00},  //;(
                  {0x00,0x041,0x022,0x01c,0x00, 00},  //;)
                  {0x14,0x008,0x03e,0x008,0x14, 00},  //;*
                  {0x08,0x008,0x03e,0x008,0x08, 00},  //;+
                  {0x00,0x050,0x030,0x000,0x00, 00},  //;,
                  {0x08,0x008,0x008,0x008,0x08, 00},  //;-
                  {0x00,0x060,0x060,0x000,0x00, 00},  //;,
                  {0x20,0x010,0x008,0x004,0x02, 00},  //;/
                  {0x3E,0x051,0x049,0x045,0x3E, 00},  //;0
                  {0x00,0x042,0x07f,0x040,0x00, 00},  //;1
                  {0x42,0x061,0x051,0x049,0x46, 00},  //;2
                  {0x21,0x041,0x045,0x04b,0x31, 00},  //;3
                  {0x18,0x014,0x012,0x07f,0x10, 00},  //;4
                  {0x27,0x045,0x045,0x045,0x39, 00},  //;5
                  {0x3c,0x04a,0x049,0x049,0x30, 00},  //;6
                  {0x01,0x071,0x009,0x005,0x03, 00},  //;7
                  {0x36,0x049,0x049,0x049,0x36, 00},  //;8
                  {0x06,0x049,0x049,0x025,0x1e, 00},  //;9
                  {0x00,0x036,0x036,0x000,0x00, 00},  //;:
                  {0x00,0x056,0x036,0x000,0x00, 00},  //;;
                  {0x08,0x014,0x022,0x041,0x00, 00},  //;<
                  {0x14,0x014,0x014,0x014,0x14, 00},  //;=
                  {0x00,0x041,0x022,0x014,0x08, 00},  //;>
                  {0x02,0x001,0x051,0x009,0x06, 00},  //;?
                  {0x32,0x049,0x079,0x041,0x3e, 00},  //;@
                  {0x7e,0x011,0x011,0x011,0x7e, 00},  //;A
                  {0x7f,0x049,0x049,0x049,0x36, 00},  //;B
                  {0x3e,0x041,0x041,0x041,0x22, 00},  //;C
                  {0x7f,0x041,0x041,0x022,0x1c, 00},  //;D
                  {0x7f,0x049,0x049,0x049,0x41, 00},  //;E
                  {0x7f,0x009,0x009,0x009,0x01, 00},  //;F
                  {0x3e,0x041,0x049,0x049,0x3a, 00}, //;G40
				  
				  
				  
                  {0x7f,0x008,0x008,0x008,0x7f, 00},  //;H
                  {0x00,0x041,0x07f,0x041,0x00, 00},  //;I
                  {0x20,0x040,0x041,0x03f,0x01, 00},  //;J
                  {0x7f,0x008,0x014,0x022,0x41, 00},  //;K
                  {0x7f,0x040,0x040,0x040,0x40, 00},  //;L
                  {0x7f,0x002,0x00c,0x002,0x7f, 00},  //;M
                  {0x7f,0x004,0x008,0x010,0x7f, 00},  //;N
                  {0x3e,0x041,0x041,0x041,0x3e, 00},  //;O
                  {0x7f,0x009,0x009,0x009,0x06, 00},  //;P
                  {0x3e,0x041,0x051,0x021,0x5e, 00},  //;Q50
                  {0x7f,0x009,0x019,0x029,0x46, 00},  //;R
                  {0x46,0x049,0x049,0x049,0x31, 00},  //;S
                  {0x01,0x001,0x07f,0x001,0x01, 00},  //;T
                  {0x3f,0x040,0x040,0x040,0x3f, 00},  //;U
                  {0x1f,0x020,0x040,0x020,0x1f, 00},  //;V
                  {0x3f,0x040,0x070,0x040,0x3f, 00},  //;W

				  
				  
				 
                  {0x63,0x014,0x008,0x014,0x63, 00},  //;X
                  {0x07,0x008,0x070,0x008,0x07, 00},  //;Y
                  {0x61,0x051,0x049,0x045,0x43, 00},  //;Z
                  {0x00,0x07f,0x041,0x041,0x00, 00},  //;[60
                  {0x02,0x004,0x008,0x010,0x20, 00},  //;
                  {0x00,0x041,0x041,0x07f,0x00, 00},  //;]
                  {0x04,0x002,0x001,0x002,0x04, 00},  //;~
                  {0x40,0x040,0x040,0x040,0x40, 00},  //;_
                  {0x00,0x001,0x002,0x000,0x00, 00},  //;`
                  {0x20,0x054,0x054,0x054,0x78, 00},  //;a
                  {0x7f,0x044,0x044,0x044,0x38, 00},  //;b
                  {0x38,0x044,0x044,0x044,0x20, 00},  //;c
                  {0x38,0x044,0x044,0x048,0x7f, 00},  //;d
                  {0x38,0x054,0x054,0x054,0x18, 00},  //;e70
                  {0x08,0x07e,0x009,0x001,0x02, 00},  //;f
                  {0x0c,0x052,0x052,0x052,0x3e, 00},  //;g
                  {0x7f,0x008,0x004,0x004,0x78, 00},  //;h
                  {0x00,0x044,0x07d,0x040,0x00, 00},  //;i
                  {0x20,0x040,0x044,0x03d,0x00, 00},  //;j
                  {0x7f,0x010,0x028,0x044,0x00, 00},  //;k
                  {0x00,0x041,0x07f,0x040,0x00, 00},  //;l
                  {0x7c,0x004,0x018,0x004,0x78, 00},  //;m
                  {0x7c,0x008,0x004,0x004,0x7c, 00},  //;n
                  {0x38,0x044,0x044,0x044,0x38, 00},  //;o80
                  {0x7c,0x014,0x014,0x014,0x08, 00},  //;p
                  {0x08,0x014,0x014,0x014,0x7c, 00},  //;q
                  {0x7c,0x008,0x004,0x004,0x08, 00},  //;r
                  {0x48,0x054,0x054,0x054,0x20, 00},  //;s
                  {0x04,0x03f,0x044,0x040,0x20, 00},  //;t
                  {0x3c,0x040,0x040,0x020,0x7c, 00},  //;u
                  {0x1c,0x020,0x040,0x020,0x1c, 00},  //;v
                  {0x3c,0x040,0x020,0x040,0x3c, 00},  //;w
                  {0x44,0x028,0x010,0x028,0x44, 00},  //;x
                  {0x0c,0x050,0x050,0x050,0x3c, 00},  //;y90
                  {0x44,0x064,0x054,0x04C,0x44, 00},  //;z
                  {0x7f,0x049,0x049,0x049,0x33, 00},  //;Б
                  {0x7f,0x001,0x001,0x001,0x03, 00},  //;Г
                  {0x7c,0x055,0x054,0x055,0x00, 00},  //;Е
                  {0x77,0x008,0x07f,0x008,0x77, 00},  //;Ж
                  {0x41,0x049,0x049,0x049,0x36, 00},  //;З
                  {0x7f,0x010,0x008,0x004,0x7f, 00},  //;И
                  {0x7c,0x021,0x012,0x009,0x7c, 00},  //;©
                  {0x20,0x041,0x03f,0x001,0x7f, 00},  //;Л
                  {0x7f,0x001,0x001,0x001,0x7f, 00},  //;П100
                  {0x47,0x028,0x010,0x008,0x07, 00},  //;У
                  {0x1c,0x022,0x07f,0x022,0x1c, 00},  //;Ф
                  {0x07,0x008,0x008,0x008,0x7f, 00},  //;Ч
                  {0x7f,0x040,0x07f,0x040,0x7f, 00},  //;Ш
                  {0x01,0x07f,0x048,0x048,0x30, 00},  //;Ъ
                  {0x7f,0x048,0x030,0x000,0x7f, 00},  //;Ы
                  {0x22,0x041,0x049,0x049,0x3e, 00},  //;Э
                  {0x7f,0x008,0x03e,0x041,0x3e, 00},  //;Ю
                  {0x46,0x029,0x019,0x009,0x7f, 00},  //;Я
                  {0x3C,0x04A,0x04A,0x049,0x31, 00},  //;°110
                  {0x7c,0x054,0x054,0x028,0x00, 00},  //;¢
                  {0x7c,0x004,0x004,0x004,0x0c, 00},  //;£
                  {0x38,0x055,0x054,0x055,0x18, 00},  //;•
                  {0x6c,0x010,0x07c,0x010,0x6c, 00},  //;¶
                  {0x44,0x044,0x054,0x054,0x28, 00},  //;І
                  {0x7c,0x020,0x010,0x008,0x7c, 00},  //;®
                  {0x78,0x042,0x024,0x012,0x78, 00},  //;©
                  {0x7c,0x010,0x028,0x044,0x00, 00},  //;™
                  {0x20,0x044,0x03c,0x004,0x7c, 00},  //;Ђ
                  {0x7c,0x008,0x010,0x008,0x7c, 00},  //;ђ120
                  {0x7c,0x010,0x010,0x010,0x7c, 00},  //;≠
                  {0x7c,0x004,0x004,0x004,0x7c, 00},  //;ѓ
                  {0x04,0x004,0x07c,0x004,0x04, 00},  //;в
                  {0x0c,0x010,0x010,0x010,0x7c, 00},  //;з
                  {0x7c,0x040,0x07c,0x040,0x7c, 00},  //;и
                  {0x04,0x07c,0x050,0x050,0x20, 00},  //;к
                  {0x7c,0x050,0x050,0x020,0x7c, 00},  //;л
                  {0x7c,0x050,0x050,0x020,0x00, 00},  //;м
                  {0x28,0x044,0x054,0x054,0x38, 00},  //;н
                  {0x7c,0x010,0x038,0x044,0x38, 00},  //;о130
                  {0x08,0x054,0x034,0x014,0x7C, 00},  //;п
                  {0x10,0x028,0x044,0x010,0x28, 00},  //;<<
                  {0x28,0x010,0x044,0x028,0x10, 00},  //;>>
                  {0x04,0x002,0x07f,0x002,0x04, 00},  //;  СТРЕЛКА ВВЕРХ
                  {0x10,0x020,0x07f,0x020,0x10, 00},  //;  бва•Ђ™† ¢≠®І
                  {0xe0,0x051,0x04f,0x041,0xff, 00}, //;//Д
                  {0x7f,0x040,0x040,0x040,0xff, 00}, //;//Ц
                  {0x7f,0x040,0x07f,0x040,0xff, 00}, //;//Щ
                  {0xe0,0x054,0x04c,0x044,0xfc, 00}, //;//§
                  {0x30,0x048,0x0fe,0x048,0x30, 00}, //;//д140
                  {0x7c,0x040,0x040,0x040,0xfc, 00}, //;//ж
                  {0x7C,0x040,0x07C,0x040,0xFC, 00}, //;й
                  {0x08,0x01c,0x02a,0x008,0x0F, 00}, //;       ¢™
                  {0x17,0x008,0x014,0x01a,0x7d, 00}, //;1/4
                  {0x17,0x008,0x044,0x056,0x7d, 00}, //;1/3
                  {0x17,0x008,0x034,0x056,0x5d, 00}, //;1/2
                  {0x00,0x0d8,0x0a8,0x098,0x00, 00}, //;   2       ®≠§•™б
                  {0x0e,0x00a,0x00e,0x000,0x00, 00 }, //   gradus
                  {0x40,0x32,0x09,0x3E,0x40,0x00},   //ALFA
                  {0x90,0x0f8,0x080,0x000,0x00, 00  }, //  1         ®≠§•™б
                  {0x70,0x028,0x024,0x028,0x70, 00 }, // 150    a    181    д†І†
                  {0x7c,0x054,0x054,0x06c,0x00, 00},// ;   b  182      д†І†
                  {0x7c,0x044,0x044,0x044,0x00, 00},// ;   c  183      д†І†
                  {0x7C,0x044,0x044,0x044,0x00, 00},// ;   0 ®≠¢•аб≠Ѓ•
				  {0x30,0x028,0x024,0x028,0x30, 00}};//		
	
	
	/* 
// Значение температуры, возвращаемое если сумма результатов АЦП больше первого значения таблицы
#define TEMPERATURE_UNDER -550
// Значение температуры, возвращаемое если сумма результатов АЦП меньше последнего значения таблицы
#define TEMPERATURE_OVER 1250
// Значение температуры соответствующее первому значению таблицы
#define TEMPERATURE_TABLE_START -550
// Шаг таблицы 
#define TEMPERATURE_TABLE_STEP 50




Таблица суммарного значения АЦП в зависимости от температуры. От большего значения к меньшему
   Для построения таблицы использованы следующие парамертры:
     R1(T1): 10кОм(25°С)
     Таблица R/T характеристик: EPCOS R/T:1010; B25/100:3530K
     Схема включения: A
     Ra: 10кОм
     Напряжения U0/Uref: 3.3В/3.3В
*//*
const temperature_table_entry_type termo_table[] PROGMEM = {
    1005, 998, 989, 978, 964, 947, 926, 900,
    871, 837, 798, 756, 710, 662, 612, 562,
    512, 463, 417, 373, 333, 296, 262, 232,
    205, 181, 160, 141, 125, 110, 98, 87,
    77, 69, 61, 55, 49
};

// Функция вычисляет значение температуры в десятых долях градусов Цельсия
// в зависимости от суммарного значения АЦП.
int16_t calc_temperature(temperature_table_entry_type adcsum) {
  temperature_table_index_type l = 0;
  temperature_table_index_type r = (sizeof(termo_table) / sizeof(termo_table[0])) - 1;
  temperature_table_entry_type thigh = TEMPERATURE_TABLE_READ(r);
  
  // Проверка выхода за пределы и граничных значений
  if (adcsum <= thigh) {
    #ifdef TEMPERATURE_UNDER
      if (adcsum < thigh) 
        return TEMPERATURE_UNDER;
    #endif
    return TEMPERATURE_TABLE_STEP * r + TEMPERATURE_TABLE_START;
  }
  temperature_table_entry_type tlow = TEMPERATURE_TABLE_READ(0);
  if (adcsum >= tlow) {
    #ifdef TEMPERATURE_OVER
      if (adcsum > tlow)
        return TEMPERATURE_OVER;
    #endif
    return TEMPERATURE_TABLE_START;
  }

  // Двоичный поиск по таблице
  while ((r - l) > 1) {
    temperature_table_index_type m = (l + r) >> 1;
    temperature_table_entry_type mid = TEMPERATURE_TABLE_READ(m);
    if (adcsum > mid) {
      r = m;
    } else {
      l = m;
    }
  }
  temperature_table_entry_type vl = TEMPERATURE_TABLE_READ(l);
  if (adcsum >= vl) {
    return l * TEMPERATURE_TABLE_STEP + TEMPERATURE_TABLE_START;
  }
  temperature_table_entry_type vr = TEMPERATURE_TABLE_READ(r);
  temperature_table_entry_type vd = vl - vr;
  int16_t res = TEMPERATURE_TABLE_START + r * TEMPERATURE_TABLE_STEP; 
  if (vd) {
    // Линейная интерполяция
    res -= ((TEMPERATURE_TABLE_STEP * (int32_t)(adcsum - vr) + (vd >> 1)) / vd);
  }
  return res;
}

*/

/*

T,°С	R/R1	R,килоОм	U,В	I,мкА	P,мВт	U/Uref	ADC	E,°С
-55	52.826	528.26	2.10208	3.979	0.008	1.0264041		
-50	38.643	386.43	1.98605	5.139	0.01	0.9697517	63554	0.2014
-45	28.574	285.74	1.8519	6.481	0.012	0.9042456	59261	0.1526
-40	21.346	213.46	1.70245	7.975	0.014	0.8312744	54478	0.1036
-35	16.1	161	1.54215	9.579	0.015	0.7530008	49349	0.0549
-30	12.256	122.56	1.37671	11.233	0.015	0.6722204	44055	0.0191
-25	9.4071	94.071	1.21181	12.882	0.016	0.5917049	38778	0.0684
-20	7.2862	72.862	1.05376	14.462	0.015	0.5145311	33720	0.1004
-15	5.6835	56.835	0.90597	15.94	0.014	0.4423672	28991	0.1429
-10	4.4698	44.698	0.77226	17.277	0.013	0.3770818	24712	0.1671
-5	3.5385	35.385	0.65341	18.466	0.012	0.31905	20909	0.1994
0	2.8222	28.222	0.55026	19.497	0.011	0.26868	17608	0.2161
5	2.2649	22.649	0.46166	20.383	0.009	0.2254214	14773	0.2396
10	1.83	18.3	0.38673	21.133	0.008	0.1888324	12375	0.2516
15	1.4872	14.872	0.32366	21.763	0.007	0.1580394	10357	0.2697
20	1.2161	12.161	0.27106	22.289	0.006	0.1323541	8674	0.2804
25	1	10	0.22727	22.727	0.005	0.110973	7273	0.2934
30	0.82677	8.2677	0.19091	23.091	0.004	0.0932172	6109	0.3076
35	0.68708	6.8708	0.16073	23.393	0.004	0.0784799	5143	0.3254
40	0.57401	5.7401	0.13571	23.643	0.003	0.0662659	4343	0.3386
45	0.48181	4.8181	0.11492	23.851	0.003	0.0561112	3677	0.3628
50	0.40638	4.0638	0.09763	24.024	0.002	0.0476697	3124	0.3838
55	0.34427	3.4427	0.0832	24.168	0.002	0.0406265	2662	0.4163
60	0.29296	2.9296	0.07116	24.288	0.002	0.0347439	2277	0.4459
65	0.25035	2.5035	0.06106	24.389	0.001	0.0298139	1954	0.4837
70	0.21478	2.1478	0.05257	24.474	0.001	0.025667	1682	0.5347
75	0.18501	1.8501	0.04541	24.546	0.001	0.022174	1453	0.5889
80	0.15995	1.5995	0.03936	24.606	0.001	0.0192178	1259	0.6599
85	0.13881	1.3881	0.03423	24.658	0.001	0.0167126	1095	0.7315
90	0.12088	1.2088	0.02986	24.701	0.001	0.0145796	955	0.8249
95	0.10563	1.0563	0.02613	24.739	0.001	0.0127595	836	0.9195
100	0.092597	0.92597	0.02294	24.771	0.001	0.0111996	734	1.033
105	0.081442	0.81442	0.0202	24.798	0.001	0.0098613	646	1.1726
110	0.071842	0.71842	0.01783	24.822	0	0.0087072	571	1.3062
115	0.063571	0.63571	0.01579	24.842	0	0.0077111	505	1.5044
120	0.056407	0.56407	0.01402	24.86	0	0.006847	449	1.6759
125	0.050196	0.50196	0.01249	24.875	0	0.0060968	400






T,°С	R/R1	R,килоОм	U,В	I,мкА	P,мВт	U/Uref	ADC	E,°С
-55	47.0794806	470.794806	2.09501	4.45	0.009	1.0229524		
-50	34.1302995	341.302995	1.96443	5.756	0.011	0.9591952	62862	0.1761
-45	25.094083	250.94083	1.81623	7.238	0.013	0.8868317	58119	0.1225
-40	18.6952569	186.952569	1.65484	8.852	0.015	0.8080255	52955	0.0707
-35	14.1013141	141.013141	1.48612	10.539	0.016	0.7256424	47556	0.0214
-30	10.7603059	107.603059	1.31651	12.235	0.016	0.6428278	42128	0.0539
-25	8.3008406	83.008406	1.15209	13.879	0.016	0.5625418	36867	0.0947
-20	6.4695121	64.695121	0.99776	15.422	0.015	0.4871857	31928	0.1311
-15	5.0911314	50.911314	0.85689	16.831	0.014	0.4184044	27421	0.1616
-10	4.0430711	40.430711	0.73128	18.087	0.013	0.3570697	23401	0.1877
-5	3.2384824	32.384824	0.62135	19.186	0.012	0.3033941	19883	0.2093
0	2.6151693	26.151693	0.52655	20.134	0.011	0.257105	16850	0.2266
5	2.1281189	21.281189	0.44569	20.943	0.009	0.2176237	14262	0.242
10	1.7444277	17.444277	0.37727	21.627	0.008	0.184215	12073	0.2543
15	1.4398145	14.398145	0.31968	22.203	0.007	0.1560958	10230	0.2661
20	1.1961984	11.961984	0.27137	22.686	0.006	0.1325063	8684	0.2772
25	1	        10	        0.23091	23.091	0.005	0.1127486	7389	0.2888
30	0.8409366	8.409366	0.19703	23.43	0.005	0.0962056	6305	0.3007
35	0.7111613	7.111613	0.16864	23.714	0.004	0.0823446	5397	0.3131
40	0.6046409	6.046409	0.14482	23.952	0.003	0.070714	4634	0.3313
45	0.5167042	5.167042	0.12479	24.152	0.003	0.0609349	3993	0.3504
50	0.4437094	4.437094	0.10791	24.321	0.003	0.0526924	3453	0.3715
55	0.3827991	3.827991	0.09365	24.464	0.002	0.0457257	2997	0.3938
60	0.3317173	3.317173	0.08155	24.584	0.002	0.0398198	2610	0.423
65	0.2886721	2.886721	0.07127	24.687	0.002	0.0347976	2280	0.4646
70	0.2522322	2.522322	0.06249	24.775	0.002	0.0305131	2000	0.4983
75	0.2212482	2.212482	0.05498	24.85	0.001	0.026846	1759	0.5525
80	0.1947918	1.947918	0.04853	24.915	0.001	0.0236971	1553	0.6028
85	0.1721099	1.721099	0.04298	24.97	0.001	0.0209845	1375	0.6684
90	0.1525884	1.525884	0.03817	25.018	0.001	0.0186401	1222	0.7289
95	0.1357242	1.357242	0.03401	25.06	0.001	0.0166076	1088	0.8246
100	0.1211034	1.211034	0.03039	25.096	0.001	0.0148399	973	    0.8978
105	0.1083838	1.083838	0.02723	25.128	0.001	0.013298	871	    1.0244
110	0.0972815	0.972815	0.02447	25.155	0.001	0.0119489	783	    1.1297
115	0.0875599	0.875599	0.02205	25.18	0.001	0.0107652	706	    1.24
120	0.0790211	0.790211	0.01991	25.201	0.001	0.0097236	637	    1.4112
125	0.0714991	0.714991	0.01803	25.22	0	    0.0088046	577

 Таблица суммарного значения АЦП в зависимости от температуры. От большего значения к меньшему
   Для построения таблицы использованы следующие парамертры:
     R1(T1): 10кОм(25°С)
     R2(T2): 1.211034кОм(100°С)
     Схема включения: A
     Ra: 100кОм
     Напряжения U0/Uref: 2.54В/2.048В

const temperature_table_entry_type termo_table[] PROGMEM = {
    62862, 58119, 52955, 47556, 42128, 36867, 31928, 27421,
    23401, 19883, 16850, 14262, 12073, 10230, 8684, 7389,
    6305, 5397, 4634, 3993, 3453, 2997, 2610, 2280,
    2000, 1759, 1553, 1375, 1222, 1088, 973, 871,
    783, 706, 637, 577
};



T,°С	R/R1	R,килоОм	U,В	I,мкА	P,мВт	U/Uref	ADC	E,°С
-55	47.0794806	470.794806	2.09501	4.45	0.009	1.0229524		
-54	44.0943973	440.943973	2.07045	4.695	0.01	1.0109621		
-53	41.3231674	413.231674	2.0451	4.949	0.01	0.9985824	65443	0.0269
-52	38.7488424	387.488424	2.01896	5.21	0.011	0.9858213	64607	0.0262
-51	36.3559384	363.559384	1.99207	5.479	0.011	0.9726884	63746	0.025
-50	34.1302995	341.302995	1.96443	5.756	0.011	0.9591952	62862	0.0243
-49	32.058975	320.58975	1.93609	6.039	0.012	0.9453545	61955	0.0235
-48	30.1301088	301.301088	1.90706	6.329	0.012	0.931181	61026	0.0226
-47	28.332839	283.32839	1.87738	6.626	0.012	0.9166908	60076	0.0217
-46	26.6572084	266.572084	1.84709	6.929	0.013	0.9019014	59107	0.021
-45	25.094083	250.94083	1.81623	7.238	0.013	0.8868317	58119	0.0201
-44	23.6350781	236.350781	1.78484	7.552	0.013	0.871502	57115	0.0198
-43	22.2724923	222.724923	1.75295	7.87	0.014	0.8559336	56094	0.0188
-42	20.999247	209.99247	1.72063	8.194	0.014	0.8401491	55060	0.0184
-41	19.8088322	198.088322	1.6879	8.521	0.014	0.8241717	54013	0.0179
-40	18.6952569	186.952569	1.65484	8.852	0.015	0.8080255	52955	0.0174
-39	17.6530044	176.530044	1.62147	9.185	0.015	0.7917354	51887	0.0167
-38	16.6769915	166.769915	1.58787	9.521	0.015	0.7753265	50812	0.0163
-37	15.7625321	157.625321	1.55407	9.859	0.015	0.7588243	49730	0.0156
-36	14.9053031	149.053031	1.52014	10.199	0.016	0.7422543	48644	0.0152
-35	14.1013141	141.013141	1.48612	10.539	0.016	0.7256424	47556	0.0151
-34	13.3468799	133.468799	1.45206	10.879	0.016	0.7090138	46466	0.0148
-33	12.6385948	126.385948	1.41802	11.22	0.016	0.6923937	45377	0.0151
-32	11.9733101	119.733101	1.38405	11.559	0.016	0.6758067	44290	0.0155
-31	11.3481127	113.481127	1.3502	11.898	0.016	0.659277	43206	0.0162
-30	10.7603059	107.603059	1.31651	12.235	0.016	0.6428278	42128	0.0166
-29	10.2073926	102.073926	1.28303	12.57	0.016	0.6264816	41057	0.017
-28	9.6870586	96.870586	1.24981	12.902	0.016	0.6102599	39994	0.0174
-27	9.1971582	91.971582	1.21689	13.231	0.016	0.5941833	38940	0.018
-26	8.7357013	87.357013	1.1843	13.557	0.016	0.5782712	37898	0.0181
-25	8.3008406	83.008406	1.15209	13.879	0.016	0.5625418	36867	0.0187
-24	7.8908608	78.908608	1.12028	14.197	0.016	0.5470121	35849	0.0193
-23	7.5041683	75.041683	1.08892	14.511	0.016	0.5316978	34845	0.02
-22	7.1392818	71.392818	1.05802	14.82	0.016	0.5166134	33857	0.0203
-21	6.7948237	67.948237	1.02763	15.124	0.016	0.5017721	32884	0.021
-20	6.4695121	64.695121	0.99776	15.422	0.015	0.4871857	31928	0.0216
-19	6.1621539	61.621539	0.96843	15.716	0.015	0.4728649	30990	0.0219
-18	5.8716377	58.716377	0.93966	16.003	0.015	0.4588189	30069	0.0227
-17	5.5969279	55.969279	0.91147	16.285	0.015	0.4450557	29167	0.0233
-16	5.3370593	53.370593	0.88388	16.561	0.015	0.4315824	28284	0.024
-15	5.0911314	50.911314	0.85689	16.831	0.014	0.4184044	27421	0.0242
-14	4.8583042	48.583042	0.83052	17.095	0.014	0.4055265	26577	0.0249
-13	4.6377933	46.377933	0.80477	17.352	0.014	0.392952	25753	0.0255
-12	4.4288663	44.288663	0.77964	17.604	0.014	0.3806836	24948	0.0268
-11	4.2308388	42.308388	0.75514	17.849	0.013	0.3687226	24165	0.0269
-10	4.0430711	40.430711	0.73128	18.087	0.013	0.3570697	23401	0.0279
-9	3.8649648	38.649648	0.70804	18.32	0.013	0.3457248	22657	0.029
-8	3.6959603	36.959603	0.68544	18.546	0.013	0.3346868	21934	0.0295
-7	3.5355336	35.355336	0.66346	18.765	0.012	0.323954	21231	0.03
-6	3.3831942	33.831942	0.6421	18.979	0.012	0.3135241	20547	0.0311
-5	3.2384824	32.384824	0.62135	19.186	0.012	0.3033941	19883	0.0321
-4	3.1009677	31.009677	0.60121	19.388	0.012	0.2935605	19239	0.0326
-3	2.9702462	29.702462	0.58167	19.583	0.011	0.2840194	18613	0.034
-2	2.8459392	28.459392	0.56272	19.773	0.011	0.2747663	18007	0.0346
-1	2.7276914	27.276914	0.54435	19.956	0.011	0.2657966	17419	0.0357
0	2.6151693	26.151693	0.52655	20.134	0.011	0.257105	16850	0.0362
1	2.5080595	25.080595	0.50931	20.307	0.01	0.2486862	16298	0.0374
2	2.4060679	24.060679	0.49261	20.474	0.01	0.2405346	15764	0.0383
3	2.3089181	23.089181	0.47646	20.635	0.01	0.2326443	15247	0.0393
4	2.2163499	22.163499	0.46082	20.792	0.01	0.2250094	14746	0.041
5	2.1281189	21.281189	0.44569	20.943	0.009	0.2176237	14262	0.0422
6	2.0439952	20.439952	0.43107	21.089	0.009	0.2104811	13794	0.0433
7	1.9637621	19.637621	0.41692	21.231	0.009	0.2035752	13342	0.0439
8	1.887216	18.87216	0.40325	21.367	0.009	0.1968998	12904	0.0458
9	1.8141649	18.141649	0.39004	21.5	0.008	0.1904485	12481	0.0474
10	1.7444277	17.444277	0.37727	21.627	0.008	0.184215	12073	0.0481
11	1.6778342	16.778342	0.36494	21.751	0.008	0.1781929	11678	0.05
12	1.6142235	16.142235	0.35303	21.87	0.008	0.1723762	11297	0.0512
13	1.553444	15.53444	0.34152	21.985	0.008	0.1667585	10929	0.0525
14	1.4953526	14.953526	0.33041	22.096	0.007	0.1613337	10573	0.0548
15	1.4398145	14.398145	0.31968	22.203	0.007	0.1560958	10230	0.0561
16	1.386702	13.86702	0.30933	22.307	0.007	0.1510389	9898	0.0587
17	1.3358948	13.358948	0.29933	22.407	0.007	0.1461572	9579	0.059
18	1.2872792	12.872792	0.28968	22.503	0.007	0.1414449	9270	0.0611
19	1.2407476	12.407476	0.28036	22.596	0.006	0.1368964	8972	0.0629
20	1.1961984	11.961984	0.27137	22.686	0.006	0.1325063	8684	0.0653
21	1.1535355	11.535355	0.2627	22.773	0.006	0.1282691	8406	0.068
22	1.112668	11.12668	0.25432	22.857	0.006	0.1241798	8138	0.0701
23	1.0735098	10.735098	0.24624	22.938	0.006	0.1202332	7880	0.0711
24	1.0359795	10.359795	0.23844	23.016	0.005	0.1164244	7630	0.0741
25	1	        10	        0.23091	23.091	0.005	0.1127486	7389	0.0767
26	0.9654982	9.654982	0.22364	23.164	0.005	0.1092011	7157	0.078
27	0.9324048	9.324048	0.21663	23.234	0.005	0.1057773	6932	0.082
28	0.9006544	9.006544	0.20986	23.301	0.005	0.102473	6716	0.0833
29	0.8701846	8.701846	0.20333	23.367	0.005	0.0992838	6507	0.0859
30	0.8409366	8.409366	0.19703	23.43	0.005	0.0962056	6305	0.0894
31	0.8128544	8.128544	0.19094	23.491	0.004	0.0932344	6110	0.093
32	0.7858849	7.858849	0.18507	23.549	0.004	0.0903664	5922	0.0961
33	0.7599777	7.599777	0.1794	23.606	0.004	0.0875978	5741	0.098
34	0.735085	7.35085	    0.17393	23.661	0.004	0.0849251	5566	0.1007
35	0.7111613	7.111613	0.16864	23.714	0.004	0.0823446	5397	0.1037
36	0.6881635	6.881635	0.16354	23.765	0.004	0.0798532	5233	0.1093
37	0.6660506	6.660506	0.15861	23.814	0.004	0.0774475	5076	0.1107
38	0.6447836	6.447836	0.15385	23.861	0.004	0.0751244	4923	0.1168
39	0.6243255	6.243255	0.14926	23.907	0.004	0.0728809	4776	0.1205
40	0.6046409	6.046409	0.14482	23.952	0.003	0.070714	4634	0.1244
41	0.5856965	5.856965	0.14054	23.995	0.003	0.068621	4497	0.1278
42	0.5674602	5.674602	0.1364	24.036	0.003	0.0665991	4365	0.1301
43	0.5499018	5.499018	0.13239	24.076	0.003	0.0646458	4237	0.1343
44	0.5329923	5.329923	0.12853	24.115	0.003	0.0627586	4113	0.1399
45	0.5167042	5.167042	0.12479	24.152	0.003	0.0609349	3993	0.1465
46	0.5010113	5.010113	0.12119	24.188	0.003	0.0591725	3878	0.1491
47	0.4858886	4.858886	0.1177	24.223	0.003	0.0574692	3766	0.1556
48	0.4713124	4.713124	0.11433	24.257	0.003	0.0558228	3658	0.1612
49	0.4572598	4.572598	0.11107	24.289	0.003	0.0542312	3554	0.1649
50	0.4437094	4.437094	0.10791	24.321	0.003	0.0526924	3453	0.171
51	0.4306405	4.306405	0.10487	24.351	0.003	0.0512044	3356	0.1738
52	0.4180333	4.180333	0.10192	24.381	0.002	0.0497656	3261	0.1832
53	0.4058692	4.058692	0.09907	24.409	0.002	0.0483739	3170	0.188
54	0.3941302	3.941302	0.09631	24.437	0.002	0.0470279	3082	0.1928
55	0.3827991	3.827991	0.09365	24.464	0.002	0.0457257	2997	0.1969
56	0.3718598	3.718598	0.09107	24.489	0.002	0.0444658	2914	0.2059
57	0.3612965	3.612965	0.08857	24.514	0.002	0.0432467	2834	0.2131
58	0.3510944	3.510944	0.08615	24.538	0.002	0.042067	2757	0.2178
59	0.3412392	3.412392	0.08381	24.562	0.002	0.0409251	2682	0.2259
60	0.3317173	3.317173	0.08155	24.584	0.002	0.0398198	2610	0.23
61	0.3225158	3.225158	0.07936	24.606	0.002	0.0387498	2540	0.2363
62	0.3136221	3.136221	0.07724	24.628	0.002	0.0377137	2472	0.2445
63	0.3050244	3.050244	0.07518	24.648	0.002	0.0367104	2406	0.2541
64	0.2967114	2.967114	0.07319	24.668	0.002	0.0357388	2342	0.2646
65	0.2886721	2.886721	0.07127	24.687	0.002	0.0347976	2280	0.2755
66	0.2808961	2.808961	0.0694	24.706	0.002	0.0338859	2221	0.2777
67	0.2733735	2.733735	0.06759	24.724	0.002	0.0330025	2163	0.2873
68	0.2660946	2.660946	0.06584	24.742	0.002	0.0321466	2107	0.2954
69	0.2590505	2.590505	0.06414	24.759	0.002	0.0313171	2052	0.3104
70	0.2522322	2.522322	0.06249	24.775	0.002	0.0305131	2000	0.3133
71	0.2456315	2.456315	0.06089	24.791	0.002	0.0297337	1949	0.3222
72	0.2392403	2.392403	0.05935	24.807	0.001	0.0289781	1899	0.3369
73	0.2330509	2.330509	0.05785	24.822	0.001	0.0282455	1851	0.3471
74	0.2270558	2.270558	0.05639	24.836	0.001	0.027535	1805	0.3515
75	0.2212482	2.212482	0.05498	24.85	0.001	0.026846	1759	0.3716
76	0.215621	2.15621	    0.05361	24.864	0.001	0.0261776	1716	0.3735
77	0.2101679	2.101679	0.05228	24.877	0.001	0.0255292	1673	0.3907
78	0.2048827	2.048827	0.051	24.89	0.001	0.0249001	1632	0.3996
79	0.1997592	1.997592	0.04975	24.903	0.001	0.0242896	1592	0.4114
80	0.1947918	1.947918	0.04853	24.915	0.001	0.0236971	1553	0.4259
81	0.1899749	1.899749	0.04735	24.926	0.001	0.0231221	1515	0.4427
82	0.1853032	1.853032	0.04621	24.938	0.001	0.0225638	1479	0.4476
83	0.1807717	1.807717	0.0451	24.949	0.001	0.0220218	1443	0.4676
84	0.1763755	1.763755	0.04402	24.96	0.001	0.0214956	1409	0.4741
85	0.1721099	1.721099	0.04298	24.97	0.001	0.0209845	1375	0.4956
86	0.1679703	1.679703	0.04196	24.98	0.001	0.0204881	1343	0.5017
87	0.1639524	1.639524	0.04097	24.99	0.001	0.0200059	1311	0.5226
88	0.1600521	1.600521	0.04001	25	    0.001	0.0195375	1280	0.5427
89	0.1562654	1.562654	0.03908	25.009	0.001	0.0190824	1251	0.5442
90	0.1525884	1.525884	0.03817	25.018	0.001	0.0186401	1222	0.56
91	0.1490174	1.490174	0.03729	25.027	0.001	0.0182103	1193	0.5909
92	0.1455488	1.455488	0.03644	25.036	0.001	0.0177925	1166	0.6006
93	0.1421793	1.421793	0.03561	25.044	0.001	0.0173864	1139	0.6249
94	0.1389055	1.389055	0.0348	25.052	0.001	0.0169915	1114	0.6287
95	0.1357242	1.357242	0.03401	25.06	0.001	0.0166076	1088	0.6597
96	0.1326325	1.326325	0.03325	25.068	0.001	0.0162342	1064	0.6684
97	0.1296273	1.296273	0.0325	25.075	0.001	0.0158711	1040	0.6913
98	0.1267059	1.267059	0.03178	25.082	0.001	0.0155179	1017	0.7072
99	0.1238654	1.238654	0.03108	25.089	0.001	0.0151743	994		0.7375
100	0.1211034	1.211034	0.03039	25.096	0.001	0.0148399	973		0.7438
101	0.1184172	1.184172	0.02973	25.103	0.001	0.0145146	951		0.773
102	0.1158045	1.158045	0.02908	25.109	0.001	0.0141981	930		0.8002
103	0.1132628	1.132628	0.02845	25.116	0.001	0.0138899	910		0.817
104	0.11079	    1.1079	    0.02783	25.122	0.001	0.01359	    891		0.8276
105	0.1083838	1.083838	0.02723	25.128	0.001	0.013298	871		.8672
106	0.1060421	1.060421	0.02665	25.133	0.001	0.0130137	853		0.8732
107	0.103763	1.03763	    0.02609	25.139	0.001	0.0127369	835		0.8947
108	0.1015444	1.015444	0.02553	25.145	0.001	0.0124673	817		0.9257
109	0.0993845	0.993845	0.025	25.15	0.001	0.0122047	800		0.9441
110	0.0972815	0.972815	0.02447	25.155	0.001	0.0119489	783		0.9761
111	0.0952335	0.952335	0.02396	25.16	0.001	0.0116998	767		0.9936
112	0.093239	0.93239	    0.02346	25.165	0.001	0.011457	751		1.0202
113	0.0912963	0.912963	0.02298	25.17	0.001	0.0112204	735		1.063
114	0.0894037	0.894037	0.02251	25.175	0.001	0.0109899	720		1.0869
115	0.0875599	0.875599	0.02205	25.18	0.001	0.0107652	706		.111
116	0.0857632	0.857632	0.0216	25.184	0.001	0.0105462	691		1.1408
117	0.0840124	0.840124	0.02116	25.188	0.001	0.0103327	677		1.1702
118	0.082306	0.82306	    0.02074	25.193	0.001	0.0101245	664		1.1991
119	0.0806426	0.806426	0.02032	25.197	0.001	0.0099216	650		1.2326
120	0.0790211	0.790211	0.01991	25.201	0.001	0.0097236	637		1.2648
121	0.0774402	0.774402	0.01952	25.205	0	    0.0095306	625		1.2904
122	0.0758987	0.758987	0.01913	25.209	0	    0.0093423	612		1.3295
123	0.0743954	0.743954	0.01876	25.212	0	    0.0091586	600		1.3611
124	0.0729292	0.729292	0.01839	25.216	0	    0.0089794	588		1.4059
125	0.0714991	0.714991	0.01803	25.22	0	    0.0088046	577

 Таблица суммарного значения АЦП в зависимости от температуры. От большего значения к меньшему
   Для построения таблицы использованы следующие парамертры:
     R1(T1): 10кОм(25°С)
     R2(T2): 1.211034кОм(100°С)
     Схема включения: A
     Ra: 100кОм
     Напряжения U0/Uref: 2.54В/2.048В

const temperature_table_entry_type termo_table[] PROGMEM = {
    65443, 64607, 63746, 62862, 61955, 61026, 60076, 59107,
    58119, 57115, 56094, 55060, 54013, 52955, 51887, 50812,
    49730, 48644, 47556, 46466, 45377, 44290, 43206, 42128,
    41057, 39994, 38940, 37898, 36867, 35849, 34845, 33857,
    32884, 31928, 30990, 30069, 29167, 28284, 27421, 26577,
    25753, 24948, 24165, 23401, 22657, 21934, 21231, 20547,
    19883, 19239, 18613, 18007, 17419, 16850, 16298, 15764,
    15247, 14746, 14262, 13794, 13342, 12904, 12481, 12073,
    11678, 11297, 10929, 10573, 10230, 9898,  9579,  9270,
    8972,  8684,  8406,  8138,  7880,  7630,  7389,  7157,
    6932,  6716,  6507,  6305,  6110,  5922,  5741,  5566,
    5397,  5233,  5076,  4923,  4776,  4634,  4497,  4365,
    4237,  4113,  3993,  3878,  3766,  3658,  3554,  3453,
    3356,  3261,  3170,  3082,  2997,  2914,  2834,  2757,
    2682,  2610,  2540,  2472,  2406,  2342,  2280,  2221,
    2163,  2107,  2052,  2000,  1949,  1899,  1851,  1805,
    1759,  1716,  1673,  1632,  1592,  1553,  1515,  1479,
    1443,  1409,  1375,  1343,  1311,  1280,  1251,  1222,
    1193,  1166,  1139,  1114,  1088,  1064,  1040,  1017,
    994,   973,   951,   930,   910,   891,   871,   853,
    835,   817,   800,   783,   767,   751,   735,   720,
    706,   691,   677,   664,   650,   637,   625,   612,
    600,   588,   577
};

#define		AD_SET_CHAN(x)		{ ADCON0 = ADCON0_INIT | (x << 2); }
#define		AD_CONVERT()		{ GO_nDONE = 1; while(GO_nDONE); }
#define		VREF_COMP(x)		{ x = (unsigned int)x * VREF_VDD_MAX / vref; }

#define		STOP_CONVERTER()	{ increment = 0; set_NCO(); TRIS_NCO = 1; }
#define  	START_CONVERTER()	{ warmup = WARMUP_TIME; TRIS_NCO = 0; }

#define		ISENSE		iout
#define		VSENSE		vout

#define		SET_VOLTAGE(x)		{ vref = x; }
#define		SET_CURRENT(x)		{ iref = x; }
#define		SET_LED_BLINK(x)	{ led_state = x; }

#define		CONSTANT_VOLTAGE	(!cmode)
#define		I_BAT_DETECT		16 

#define		STOUS(x)		{ x -= 1; x = ~x; }
#define		USTOS(x)		{ x = ~x; x += 1; }

#define		BUTTON				RA3
*/
